datagutt/firmware-esp32-exp/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.2 Project Minimal Configuration

# Ensures the binary is deterministic (bit-for-bit identical).
CONFIG_APP_REPRODUCIBLE_BUILD=y

# Length of the SHA256 hash of the ELF file stored in the app header.
CONFIG_APP_RETRIEVE_LEN_ELF_SHA=16

# Optimize for size (-Os) to reduce IRAM/flash usage (~10-30KB savings).
# CPU-bound WebP decoding is exempt: the libwebp component pins -O2 in its
# own CMakeLists.
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# Configure the flasher for 8MB of flash memory.
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# Roll back to the previous app if the new one never confirms it is healthy.
# On factory-only boards (4MB pixoticker) the running partition is never in
# PENDING_VERIFY state, so the confirm call is a no-op there.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# Allow firmware updates over insecure HTTP.
CONFIG_ESP_HTTPS_OTA_ALLOW_HTTP=y

# Interrupt Watchdog timeout.
CONFIG_ESP_INT_WDT_TIMEOUT_MS=300

# Increase stack size for the main application task.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Increase system event task stack so httpd_start() can be called
# from WiFi event handlers without overflow.
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096

# Reduce PHY TX power when brownout reset.
CONFIG_ESP_PHY_REDUCE_TX_POWER=y

# Enable TLS session tickets for faster reconnects.
CONFIG_ESP_TLS_CLIENT_SESSION_TICKETS=y

# Enable 802.11R (Fast Transition) Support.
CONFIG_ESP_WIFI_11R_SUPPORT=y

# Wifi sleep optimize when beacon lost
CONFIG_ESP_WIFI_SLP_BEACON_LOST_OPT=y

# Place additional frequently called Wi-Fi library functions in IRAM.
# Costs 5 KB of IRAM but increases WiFi throughput.
CONFIG_ESP_WIFI_EXTRA_IRAM_OPT=y

# Use static allocation for WiFi TX buffers (increases stability).
# If PSRAM is enabled, "Static" should be selected to guarantee enough WiFi TX buffers.
CONFIG_ESP_WIFI_STATIC_TX_BUFFER=y

# Reduce WiFi static buffer counts from defaults (16) to save ~25KB internal RAM.
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=8
CONFIG_ESP_WIFI_STATIC_TX_BUFFER_NUM=8

# Allow task stacks to be placed in external PSRAM (saves internal RAM).
CONFIG_FREERTOS_TASK_CREATE_ALLOW_EXT_MEM=y

# Enable FreeRTOS trace facility for task_dump console command.
CONFIG_FREERTOS_USE_TRACE_FACILITY=y

# Enable per-task CPU usage tracking for runtime performance analysis.
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y

# Set FreeRTOS tick rate to 4ms. Animation frame timing is 10ms+ minimum,
# so 250Hz provides sufficient resolution while reducing tick interrupt overhead.
CONFIG_FREERTOS_HZ=250

# Increase stack size for the internal FreeRTOS timer task.
# The default is too small.
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096

# Enable double buffering for smooth animations.
CONFIG_HUB75_DOUBLE_BUFFER=y

# Width of a single LED panel.
CONFIG_HUB75_PANEL_WIDTH=64

# Height of a single LED panel.
CONFIG_HUB75_PANEL_HEIGHT=32

# Use the driver for FM6126A shift registers.
CONFIG_HUB75_DRIVER_FM6126A=y

# Insert blanking cycles during latching to prevent ghosting.
CONFIG_HUB75_LATCH_BLANKING=1

# Set the display frequency to 8 MHz
# Increasing this improves refresh rates and color accuracy, but WiFi
# stability suffers. See
# https://github.com/mrcodetastic/ESP32-HUB75-MatrixPanel-DMA/discussions/258
CONFIG_HUB75_CLK_8MHZ=y

# Increase max request header size from default 512 to accommodate
# Authorization headers with API keys.
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024

# Target SoC architecture.
CONFIG_IDF_TARGET="esp32"

# Logging
CONFIG_LOG_COLORS=n
CONFIG_LOG_TIMESTAMP_SOURCE_SYSTEM_FULL=y
CONFIG_LOG_VERSION_2=y

# Max number of IP addresses returned per DNS query.
CONFIG_LWIP_DNS_MAX_HOST_IP=4

# Enable NTP server acquisition via DHCP Option 42
CONFIG_LWIP_DHCP_GET_NTP_SRV=y
CONFIG_LWIP_SNTP_MAX_SERVERS=3

# Enable IPv6 Stateless Address Autoconfiguration (SLAAC).
CONFIG_LWIP_IPV6_AUTOCONFIG=y

# Max DNS servers to accept via IPv6 Router Advertisements.
CONFIG_LWIP_IPV6_RDNSS_MAX_DNS_SERVERS=2

# Enable proper socket teardown to prevent socket leaks on connection drops.
CONFIG_LWIP_SO_LINGER=y

# Increase max sockets from default 10 to support concurrent httpd, WebSocket
# client, mDNS, DNS, and SNTP connections without exhaustion under load.
# 16 covers ~10-12 concurrent connections with headroom; saves ~8KB vs 32.
CONFIG_LWIP_MAX_SOCKETS=16

# Allow checking for available data on a netconn.
CONFIG_LWIP_SO_RCVBUF=y

# Use esp_getaddrinfo() instead of lwip_getaddrinfo() for IPv4/IPv6 dual stacks.
CONFIG_LWIP_USE_ESP_GETADDRINFO=y

# Force mbedTLS to use PSRAM for large allocations (saves internal RAM).
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y

# Enable TLS 1.3 support.
CONFIG_MBEDTLS_SSL_PROTO_TLS1_3=y

# Handle cross-signed certificates (e.g. GTS Root R4 cross-signed by GlobalSign).
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_CROSS_SIGNED_VERIFY=y

# Merge a CUSTOM_CA from secrets.json into the compiled-in certificate bundle
# (generate_secrets_cmake.py writes main/certs/custom_ca.pem). Devices then
# trust both the custom CA and the default public roots through the same
# esp_crt_bundle_attach, so no branching TLS setup is needed. A no-op when
# CUSTOM_CA is unset: the placeholder .pem contributes zero certificates.
CONFIG_MBEDTLS_CUSTOM_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CUSTOM_CERTIFICATE_BUNDLE_PATH="main/certs"

# The hardware RSA accelerator caps out at SOC_RSA_MAX_BIT_LEN (4096 bits) on
# every chip family we target. A CUSTOM_CA with a larger RSA key needs this
# software fallback, otherwise verification silently produces a bad result.
CONFIG_MBEDTLS_LARGE_KEY_SOFTWARE_MPI=y

# Do not put math/fast functions in IRAM (saves internal RAM).
CONFIG_NO_FAST_FUNCTIONS=y

# Use a custom partition table layout.
CONFIG_PARTITION_TABLE_CUSTOM=y

# Path to the custom partition table.
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="boards/default_8mb.csv"

# Enable support for external SPI RAM (PSRAM).
CONFIG_SPIRAM=y

# Try to allocate memories of WiFi and LWIP in SPIRAM firstly. If failed, allocate internal memory
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# Allow .bss segment placed in external memory
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y

# Allow .noinit segment placed in external memory
CONFIG_SPIRAM_ALLOW_NOINIT_SEG_EXTERNAL_MEMORY=y

# Maximum malloc() size, in bytes, to always put in internal memory
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=128

# Reserve less internal RAM from malloc (default 32KB -> 16KB). Frees 16KB.
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=16384

# Application Defaults
CONFIG_REFRESH_INTERVAL_SECONDS=10
CONFIG_ENABLE_AP_MODE=y
CONFIG_ENABLE_WIFI_POWER_SAVE=y
CONFIG_SKIP_DISPLAY_VERSION=n
CONFIG_PREFER_IPV6=n

# Enable console output for debugging.
CONFIG_ENABLE_CONSOLE=y